<template>
  <SubBase class="guide" :textData="textData" />
</template>

<script>
import SubBase from "./../components/SubBase";

export default {
  name: "Guide",
  components: {
    SubBase
  },
  data() {
    return {
      textData: {
        title: "機能一覧",
        lead: "本アプリの機能を紹介します。",
        textList: [
          {
            header: "トップ",
            body: [
              {
                term: "ログイン",
                description:
                  "メールアドレスやGoogleアカウント、Twitterアカウントを使用することで、ログインし、本アプリを使用できます。<br>「ゲストとして続行」すると、アカウント不要で使用できます。<br>しかし、一度ログアウトしてしまうと、作成したデータが消えてしまうのでご注意ください。"
              }
            ]
          },
          {
            header: "一覧画面",
            body: [
              {
                term: "一覧表示",
                description:
                  "「定位置」と「試合」のタブを切り替えると、それぞれのデータ一覧が表示されます。"
              },
              {
                term: "検索",
                description:
                  "検索窓から「タイトル」「日付」「選手名（※試合データのみ）」を入力すると、データの絞り込みができます。"
              },
              {
                term: "作成",
                description:
                  "「作成」ボタンをタップすると、「定位置」もしくは「試合」の新規データを作成できます。<br>「コード入力」を選択すると、配置コードを使って、元データのコピーを作成できます。<br>★他のユーザーが作ったデータを再現する時に役立ちます。"
              },
              {
                term: "編集",
                description: "データをタップすると、データを編集できます。"
              },
              {
                term: "アイテムメニュー",
                icon: "mdi-dots-horizontal",
                description:
                  "をタップすると、「複製」や「削除」、「コードのコピー」などのメニューが表示されます。"
              },
              {
                term: "複製",
                description: "「複製」をタップすると、データを複製できます。"
              },
              {
                term: "削除",
                description: "「削除」をタップすると、データを削除できます。"
              },
              {
                term: "コードをコピー",
                description:
                  "「コードをコピー」をタップすると、配置コードをコピーできます。"
              },
              {
                term: "メニュー",
                icon: "mdi-menu",
                description:
                  "をタップすると、「設定」や「使い方」、「ログアウト」などのメニューが表示されます。"
              },
              {
                term: "設定",
                description:
                  "「設定」をタップすると、ユーザーの設定を変更できます。"
              },
              {
                term: "旧仮名遣い表記",
                description:
                  "「旧仮名遣い表記」にチェックを入れると、新規作成・編集画面や確認画面で表示される表記が旧仮名遣いになります。<br>（例）あい→あひ、おおこ→あふこ"
              },
              {
                term: "機能一覧",
                description:
                  "「機能一覧」をタップすると、機能一覧画面に遷移します。"
              },
              {
                term: "ログアウト",
                description:
                  "「ログアウト」をタップすると、ログアウトできます。"
              }
            ]
          },
          {
            header: "新規作成・編集画面",
            body: [
              {
                term: "配置移動",
                description:
                  "決まり字をドラッグすることで配置を移動できます。<br>（※各段の移動させたい端にくっつけるようにドラッグする必要があります。）<br>タブを切り替えると、配置する選手を変更できます。（※試合データのみ）<br>★定位置データの場合は、画面を横向けにして使用することをおすすめします。"
              },
              {
                term: "決まり字の色付け",
                description:
                  "決まり字をタップすると、色付け（文字が赤色に変化）できます。"
              },
              {
                term: "表示間隔の変更",
                description:
                  "各段の個数表示箇所をタップすると、表示間隔を変更できます。<br>通常、決まり字同士の間は詰まって表示されますが、タップすると色が濃くなり、札間隔を広げることができます。<br>もう一度、タップすることで元に戻ります。<br>浮札（浮左、浮中、浮右）のみデフォルトで間隔が広がるように設定されています。"
              },
              {
                term: "入力選手切り替え（※試合データのみ）",
                description:
                  "選手名のタブを切り替えると、入力する選手を切り替えることができます。"
              },
              {
                term: "選手名入力（※試合データのみ）",
                description:
                  "選手名を入力できます。<br>選手名が入力されていない場合は、「選手1」「選手2」で保存されます。"
              },
              {
                term: "検索",
                description:
                  "検索窓から決まり字を入力すると、決まり字の背景が黄色く表示されます。<br>検索方法は3通りあり、「ひらがな」「ローマ字（訓令式・ヘボン式）」「数字」が使用できます。<br>検索ワードの間に全角・半角スペースを挟むことで、一度に複数検索できます。<br>一覧画面の設定で、「旧仮名遣い表記」にチェックが入っている場合は、その表記で検索することもできます。"
              },
              {
                term: "ヘルプ",
                icon: "mdi-help-circle-outline",
                description:
                  "をタップすると、新規作成・編集画面の機能を順番に説明します。"
              },
              {
                term: "確認",
                description:
                  "「確認」ボタンをタップすると、全ての段が一列になった状態で確認できます。"
              },
              {
                term: "スクロール固定",
                description:
                  "「スクロール固定」ボタンをタップすると、画面スクロールを無効化できます。<br>「固定解除」ボタンをタップすると、画面スクロールを有効化できます。<br>★決まり字を動かす時に、余計なスクロールを防止するのに役立ちます。"
              }
            ]
          },
          {
            header: "確認画面",
            body: [
              {
                term: "配置確認",
                description:
                  "作成した配置を確認できます。<br>全ての段が一列になった状態で確認できます。<br>横幅が画面サイズをオーバーする場合は、横スクロールで確認できます。<br>新規作成・編集画面で色付けした決まり字は赤字で表示されます。"
              },
              {
                term: "タイトル入力",
                description:
                  "タイトルを入力できます。<br>タイトルが入力されていない場合は、「タイトルなし」で保存されます。"
              },
              {
                term: "データ画像化・ダウンロード",
                icon: "mdi-arrow-down-bold-circle-outline",
                description:
                  "をタップすると、データをダウンロードできます。<br>ダウンロード後、ダウンロードしたデータを開き、画像として保存できます。<br>ダウンロードが失敗する場合は、画面に保存用の画像が表示されるので、そちらから保存することができます。"
              },
              {
                term: "保存",
                description:
                  "「保存」ボタンをタップすると、データを保存できます。"
              }
            ]
          }
        ]
      }
    };
  }
};
</script>
